IDEA Open Model
OpenElementId Class
Compatible with IDEA StatiCa Beta 20.0
 Open element base class POS - class can not be abstract -it causes problems with serialization
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 More...
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class OpenElementId : OpenObject
Public Class OpenElementId
	Inherits OpenObject
The OpenElementId type exposes the following members.
Constructors
Name | Description
OpenElementId
Initializes a new instance of the OpenElementId class
Top
Properties
Name | Description
Id
 Element Id
Top
See Also
Reference
IdeaRS.OpenModel Namespace
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.OpenElementId
 IdeaRS.OpenModel.Concrete.ConcreteSetup
 IdeaRS.OpenModel.Concrete.CheckSection
 IdeaRS.OpenModel.Connection.BeamData
 IdeaRS.OpenModel.Connection.ConnectedMember
 IdeaRS.OpenModel.Connection.ConnectionPoint
 IdeaRS.OpenModel.Connection.PlateData
 IdeaRS.OpenModel.CrossSection.CrossSection
 IdeaRS.OpenModel.CrossSection.ReinforcedCrossSection
 IdeaRS.OpenModel.Detail.DappedEnd
 IdeaRS.OpenModel.Detail.ISDModel
 IdeaRS.OpenModel.Detail.LineSupport
 IdeaRS.OpenModel.Detail.Loading.CalculationCase
 IdeaRS.OpenModel.Detail.Opening
 IdeaRS.OpenModel.Detail.PatchDevice
 IdeaRS.OpenModel.Detail.Reinforcement
 IdeaRS.OpenModel.Geometry3D.Point3D
 IdeaRS.OpenModel.Geometry3D.PointOnLine3D
 IdeaRS.OpenModel.Geometry3D.PolyLine3D
 IdeaRS.OpenModel.Geometry3D.Region3D
 IdeaRS.OpenModel.Geometry3D.Segment3D
 IdeaRS.OpenModel.Loading.CombiInput
 IdeaRS.OpenModel.Loading.LoadCase
 IdeaRS.OpenModel.Loading.LoadGroup
 IdeaRS.OpenModel.Loading.LoadInPoint
 IdeaRS.OpenModel.Loading.LoadOnLine
 IdeaRS.OpenModel.Loading.LoadOnSurface
 IdeaRS.OpenModel.Loading.PointLoadOnLine
 IdeaRS.OpenModel.Loading.ResultClass
 IdeaRS.OpenModel.Loading.SelectionItemForResults
 IdeaRS.OpenModel.Loading.Settlement
 IdeaRS.OpenModel.Loading.StrainLoadOnLine
 IdeaRS.OpenModel.Loading.TemperatureLoadOnLine
 IdeaRS.OpenModel.Material.BoltAssembly
 IdeaRS.OpenModel.Material.Material
 IdeaRS.OpenModel.Model.DesignMember
 IdeaRS.OpenModel.Model.Element1D
 IdeaRS.OpenModel.Model.Element2D
 IdeaRS.OpenModel.Model.HingeElement1D
 IdeaRS.OpenModel.Model.CheckMember
 IdeaRS.OpenModel.Model.InitialImperfectionOfPoint
 IdeaRS.OpenModel.Model.LineSupportSegment
 IdeaRS.OpenModel.Model.Member1D
 IdeaRS.OpenModel.Model.Member2D
 IdeaRS.OpenModel.Model.PointSupportNode
 IdeaRS.OpenModel.Model.RigidLink
 IdeaRS.OpenModel.Model.SubStructure
 IdeaRS.OpenModel.Model.Tendon